una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Freescale/MK40X128VMD100.h
/*
** ###################################################################
**     Processor:           MK40X128VMD100
**     Compilers:           Freescale C/C++ for Embedded ARM
**                          IAR ANSI C/C++ Compiler for ARM
**     Reference manual:    K40P144M100SF2RM, Rev. 3, 4 Nov 2010
**     Version:             rev. 1.0, 2011-01-14
**
**     Abstract:
**         This header file implements peripheral memory map for MK40X128VMD100
**         processor.
**
**     Copyright: 1997 - 2011 Freescale Semiconductor, Inc. All Rights Reserved.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 0.1 (2010-04-10)
**         Initial version
**     - rev. 0.2 (2010-08-31)
**         TSI base address fixed
**     - rev. 0.3 (2010-09-05)
**         AXBS registers for unimplemented masters/slaves removed
**     - rev. 0.4 (2010-09-06)
**         Corrected operand type-cast in bit group REG_<regType>_<groupName>(x) macros according to MISRA rules.
**     - rev. 0.5 (2010-09-24)
**         Registers updated according to the new reference manual revision - Rev. 1, 10 Sept 2010
**         CRC - 16-bit registers joined to 32-bit registers
**         RTC - prefix of symbol for peripheral instance base addresses changed  SRTC -> RTC
**         LPTMR - change of register prefix - LPT0 -> LPTMR0
**         SPI - HCR register removed
**         TSI - STATUS register removed; THRESHLD0-15 registers removed; several bits of the SCANC register removed
**         USB - change of register prefix USBOTG -> USB
**     - rev. 0.6 (2010-10-01)
**         CAN - Message buffers registers added (#MTWX43663)
**         TSI - THRESHLD0-15 registers reverted back
**     - rev. 0.7 (2010-10-26)
**         Added new #define symbols <periphInstance>_<regType>(index1,2,...) for macros accessing register arrays with fixed peripheral base address.
**     - rev. 0.8 (2010-10-27)
**         Registers updated according to the new reference manual revision - Rev. 2, 15 Oct 2010
**         ADC - Peripheral register PGA bit definition has been fixed, bits PGALP, PGACHP removed.
**         CAN - Peripheral register MCR bit definition has been fixed, bit WAKSRC removed.
**         CRC - Peripheral register layout structure has been extended with 8/16-bit access to shadow registers.
**         CMP - Peripheral base pointer macro renamed from HSCMPx_BASE_PTR to CMPx_BASE_PTR.
**         DMA - Peripheral base pointer define macro name has been changed from eDMA_BASE_PTR to DMA_BASE_PTR.
**         GPIO - Port Output Enable Register (POER) renamed to Port Data Direction Register (PDDR), all POER related macros fixed to PDDR.
**         I2S - Prefix of register names changed from "I2S_" to "I2S0_".
**         LCD - Peripheral base pointer macro name has been changed from SLCD_BASE_PTR to LCD_BASE_PTR.
**         LCD - Peripheral register layout structure has been extended with 8-bit access to LCD waveform registers.
**         NV - Non-volatile Flash register FOPT bit definition redefined, FPROTx address and register names prefix fixed from "NV" to "F".
**         PDB - Peripheral register layout structure has been extended for Channel n and DAC n register array access (#MTWX44115).
**         PDB - Prefix of register accessor macro changed from "PDB_" to "PDB0_".
**         RFSYS - System regfile registers have been added (#MTWX43999)
**         RFVBAT - VBAT  regfile registers have been added (#MTWX43999)
**         RTC - Peripheral register CR bit definition has been fixed, bit OTE removed.
**         TSI - STATUS, SCANC register bit definition have been fixed, bit groups CAPTRM, DELVOL and AMCLKDIV added.
**         TSI - Prefix of register names changed from "TSI_" to "TSI0_".
**         USB - Peripheral base pointer define macro name has been changed USBOTG0_BASE_PTR to USB0_BASE_PTR.
**         USB - Prefix of register names changed from "USBOTG0_" to "USB0_".
**         VREF - Peripheral register TRM removed.
**     - rev. 0.9 (2010-11-11)
**         Registers updated according to the new reference manual revision - Rev. 3, 4 Nov 2010
**         CAN - Individual Matching Element Update (IMEU) feature has been removed.
**         CAN - Support for INT_CANx_IMEU, INT_CANx_Lost_Rx interrupts has been removed.
**         CAN - Peripheral register layout structure has been fixed, registers IMEUR, LRFR have been removed.
**         CAN - Peripheral register CTRL2 bit definition has been fixed, bits IMEUMASK, LOSTRMMSK, LOSTRLMSK, IMEUEN have been removed.
**         CAN - Peripheral register ESR2 bit definition has been fixed, bits IMEUF, LOSTRMF, LOSTRLF have been removed.
**         NV - Fixed offset address of BACKKEYx, FPROTx registers.
**         TSI - Peripheral register layout structure has been fixed, register WUCNTR has been removed.
**     - rev. 0.10 (2010-11-30)
**         EWM - Peripheral base pointer EWM_BASE_PTR address has been fixed from 0x4005F000u to 0x40061000u (#MTWX44776).
**     - rev. 0.11 (2010-12-17)
**         AIPS0, AIPS1 - Fixed offset of PACRE-PACRP registers (#MTWX45259).
**     - rev. 1.0 (2011-01-14)
**         Added BITBAND_REG() macro to provide access to register bits using bit band region.
**         Added checking of memory map version if two memory map files are included in a project (#MTWX45472).
**
** ###################################################################
*/

/*! \file MK40X128VMD100.h */
/*! \version 1.0 */
/*! \date 2011-01-14 */
/*! \brief Peripheral memory map for MK40X128VMD100 */
/*! \detailed This header file implements peripheral memory map for MK40X128VMD100
      processor. */


/* ----------------------------------------------------------------------------
   -- MCU activation
   ---------------------------------------------------------------------------- */

/* Prevention from multiple including the same memory map */
#if !defined(MCU_MK40X128VMD100)  /* Check if memory map has not been already included */
#define MCU_MK40X128VMD100

